
class FyData{
  String header;
  List<String> bullet;

  FyData(this.header, this.bullet);
}

List<FyData> fyData = [
  
  FyData("ไม่จำเป็นต้องตามหากลุ่มซ้อมของแต่ละเกม แอพพลิเคชั่นจะเป็น Communityการซ้อมขนาดใหญ่", [
    " • มีการแบ่งแยกแต่ละเกม อย่างชัดเจนในทุกๆเกมที่มีการแข่งขันกีฬา ESPORT ทั้งเกมบน PC และ Smartphone",
    " • อาทิ RoV, PUBG & PUBGM, Valorant เป็นต้น",
    " • มีทีมงานดูแลและติดตามวิธีการซ้อม รวมถึงห้อง Scrimroom ของทุกๆเกมส์ดังกล่าว"
  ]),
  FyData("ลดขั้นตอนในการหาทีมซ้อมหรือห้องซ้อม เช่น แยกเป็น LOBBY ห้องชัดเจน แสดงทีม, ห้องซ้อมที่ว่าง", [
    " • มีห้องซ้อมเกมต่างๆ แบ่งหมวดหมู่ชัดเจน",
    " • รับรู้ว่ามีทีม, คู่ซ้อม, Scrimroom ที่ว่างและพร้อมซ้อมอยู่ในขณะนั้น"
  ]),
  FyData("ลดขั้นตอนในการนัดหมาย", [
    " • มีการแบ่งแยกแต่ละเกม อย่างชัดเจนในทุกๆเกมที่มีการแข่งขันกีฬา ESPORT ทั้งเกมบน PC และ Smartphone",
    " • อาทิ RoV, PUBG & PUBGM, Valorant เป็นต้น",
    " • มีทีมงานดูแลและติดตามวิธีการซ้อม รวมถึงห้อง Scrimroom ของทุกๆเกมส์ดังกล่าว"
  ]),
  FyData("ตัดสิ่งรบกวนหรือสิ่งที่ไม่เกี่ยวข้องกับการซ้อมทีม", [
    " • แชทบอท อัพเดท สล็อต,ทีม,ไลน์อัพ,สลิปชำระเงิน, โฆษณาอื่นๆ ,หาคนเข้าทีม ,ทำทีม",
    " • สำหรับห้อง Scrimroom แบบชำระเงิน มีระบบชำระเงินเพื่อเข้าซ้อมแยกต่างหาก"
  ]),
  FyData("เพิ่มความสามารถในการติดต่อซ้อมล่วงหน้า", [
    " • สามารถนัดหมายเพื่อซ้อมล่วงหน้าข้ามวันหรือแบบวันต่อวันได้",
    " • ระบบนัดหมายนี้สามารถ Export ตารางซ้อมให้สมาชิกทีมได้ทุกคน",
    " • มี Notification แจ้งเตือนวันซ้อม, ใกล้เวลาซ้อม เป็นต้น \n* กรณีเกมแนวสร้างห้อง Scrim Room ผู้ใช้งานสามารถสร้างห้องแล้วใช้งาน ระบบบันทึกสถิติการซ้อม ของทาง FyTy ได้จะเป็นการสร้างตารางคะแนนโดยอัตโนมัติ"  ]),
  FyData(" • หลังจากการซ้อมทีม มีระบบประเมินผู้เล่นหรือทีมคู่ซ้อมได้ทันที", [
    
  ]),
  FyData(" • มีหน้ารวมแข่งขัน Tournament ฝึกซ้อมย่อย ๆ และมีการชิงเงินรางวัล  ให้ทีมหรือผู้เล่นเลือกลงซ้อมได้อย่างสม่ำเสมอ", [
    
  ]),
  FyData(" • มีระบบบันทึกสถิติการซ้อม คำนวน อัตราชนะ จากการซ้อม ทั้งรายทีมและรายบุคคล", [
    
  ]),
  FyData(" • ระบบวิเคราะห์ผลการซ้อม ประสิทธิภาพผู้เล่นจากการซ้อม", [
    
  ]),
  FyData(" • มีหน้าตลาดนักแข่งโดยที่สามารถหาทีมแข่ง, หาสมาชิกทีม, ทำทีม แยกเป็นสัดส่วนไม่ปะปนกับ ส่วนหาห้องซ้อมและนัดหมาย", [
    
  ]),
];
